app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @artist = Artist.find_by_id(params[:artist_id])
      if !@artist
        flash[:alert] = "Artist not found."
        redirect_to artists_path
      else
        @songs = @artist.songs
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]

  def show
    if params[:artist_id]
      @artist = Artist.find_by_id(params[:artist_id])
      @song = @artist.songs.find_by_id(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 1], ["id", 1], ["LIMIT", 1]]

  def create

    @song = Song.new(song_params)

    if @song.save
---
INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Angel of Death"], ["created_at", "2020-06-10 20:46:55.856928"], ["updated_at", "2020-06-10 20:46:55.856928"], ["artist_id", 5]]